# SF Salaries Assignment

Welcome to a quick exercise for you to practice your pandas skills! We will be using the SF Salaries Dataset. Just follow along and complete the tasks.

"Import pandas as pd" in the below cell

In [1]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Check the tail of the DataFrame. **

In [4]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** Check the column names of the DataFrame. **

In [5]:
sal.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

** Check the number of rows and column of the data frame **

In [6]:
sal.shape

(148654, 13)

** Use the .info() method to find out how many entries there are.**

In [7]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

** What is the average BasePay ? **

In [8]:
sal.BasePay.mean()

66325.4488404877

** round off the base pay to 2 decimal places **

In [9]:
round(sal.BasePay.mean(),2)

66325.45

** What is the highest amount of OvertimePay in the dataset ? **

In [10]:
sal.OvertimePay.max()

245131.88

** How many missing values are in the columns "Benefits", "Notes" and "Status"  ? **

In [11]:
sal[["Benefits", "Notes" ,"Status"]].isnull().sum()

Benefits     36163
Notes       148654
Status      148654
dtype: int64

** Impute the missing values in "Benefits" column by mean of the column **

In [12]:
sal.Benefits.fillna(sal.Benefits.mean(),inplace = True)

In [13]:
sal.Benefits

0         25007.893151
1         25007.893151
2         25007.893151
3         25007.893151
4         25007.893151
              ...
148649        0.000000
148650    25007.893151
148651    25007.893151
148652    25007.893151
148653        0.000000
Name: Benefits, Length: 148654, dtype: float64

** Drop the columns "Notes" and "Status" from the data frame **

In [17]:
sal.drop(['Notes','Status'],axis =1,inplace = True)

** Now again check the missing values in the dataframe by using the .info method **

In [18]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
dtypes: float64(6), int64(2), object(3)
memory usage: 12.5+ MB

** save the dataframe as csv file in your directory **

In [19]:
sal.to_csv('sal_new.csv')

** use lambda function to increase the TotalPay column by 1000 **

In [20]:
sal['TotalPay'] = sal['TotalPay'].apply(lambda x:x+1000)

** create new column named as "EmployeeDetail" which is formed by concatenating EmployeeName & Jobtitle **

In [22]:
sal['EmployeeDetail'] = sal['EmployeeName'] + sal['JobTitle']

# Thanks you for participating in the assignment